Tekla Open API Reference for Tekla Structures 2025
LibraryProfileItem.Modify Method
 Modifies the profile item in the profile database.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Modify()
Public Function Modify As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
LibraryProfileItem Class
Tekla.Structures.Catalogs Namespace